УчетВУправляющихДляГит1/src/DataProcessors/ПанельЗемельныйНалог/ПанельЗемельныйНалог.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПанельЗемельныйНалог</name>
</mdclass:DataProcessor>

УчетВУправляющихДляГит1/src/InformationRegisters/ПорядокУплатыНалоговНаМестах/ПорядокУплатыНалоговНаМестах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокУплатыНалоговНаМестах</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>СрокУплатыНалогаМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокУплатыНалогаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УплачиваютсяАвансы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокУплатыАвансаМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокУплатыАвансаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Налог</name>
    <type>
      <types>CatalogRef.ЗадачиБухгалтера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СпособыОтраженияРасходовПоНалогам/СпособыОтраженияРасходовПоНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпособыОтраженияРасходовПоНалогам</name>
  <comment>Настройка отражения в учете расходов по имущественным налогам</comment>
  <informationRegisterPeriodicity>Quarter</informationRegisterPeriodicity>
  <resources>
    <name>ПодразделениеЗатрат</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеВУСН</name>
    <type>
      <types>EnumRef.ОтражениеВУСН</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидНалога</name>
    <type>
      <types>EnumRef.ВидыИмущественныхНалогов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/Enums/ВидыИмущественныхНалогов/ВидыИмущественныхНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИмущественныхНалогов</name>
  <enumValues>
    <name>НалогНаИмущество</name>
  </enumValues>
  <enumValues>
    <name>ТранспортныйНалог</name>
  </enumValues>
  <enumValues>
    <name>ЗемельныйНалог</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/DataProcessors/ПанельЗемельныйНалог/Forms/ПанельЗемельныйНалог/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НайденнаяСсылка = Справочники.ЗадачиБухгалтера.НайтиПоКоду("ЗемельныйНалог");
	
	Если НайденнаяСсылка <> Неопределено Тогда
		Налог = НайденнаяСсылка;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РегистрацияЗемельныхУчастков(Команда)
	
	ОткрытьФорму("РегистрСведений.РегистрацияЗемельныхУчастков.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокУплатыНалоговНаМестах(Команда)
	
	ПараметрыФормы = Новый Структура("Налог", Налог);
	
	ОткрытьФорму("РегистрСведений.ПорядокУплатыНалоговНаМестах.ФормаСписка", ПараметрыФормы, ,Налог);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособыОтраженияРасходов(Команда)
	
	ВидНалога = ПредопределенноеЗначение("Перечисление.ВидыИмущественныхНалогов.ЗемельныйНалог");
	ПараметрыФормы = Новый Структура("ВидНалога", ВидНалога);
	
	ОткрытьФорму("РегистрСведений.СпособыОтраженияРасходовПоНалогам.ФормаСписка", ПараметрыФормы, ,ВидНалога);
	
КонецПроцедуры

#КонецОбласти
